In [1]:
import numpy as np

In [2]:
import pandas as pd
import os
import urllib
%matplotlib inline

In [3]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
type(10)

int

In [7]:
type(pd.Series(data=my_data, index=labels))

pandas.core.series.Series

In [8]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [12]:
# Series can use functions

In [13]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],['USSR','Japan','Germany','UK'])

In [15]:
ser1

USSR       1
Japan      2
Germany    3
UK         4
dtype: int64

In [16]:
ser2=pd.Series([1,2,5,4],['USSR','Japan','Italy','UK'])

In [17]:
ser2

USSR     1
Japan    2
Italy    5
UK       4
dtype: int64

In [18]:
ser1['USSR']

1

In [14]:
ser1+ser2 # addition will give NaN where there is no correspondance

NameError: name 'ser1' is not defined

In [26]:
from numpy.random import randn

In [27]:
np.random.seed(101)

In [28]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [32]:
df['Y'][2]

0.5288134940893595

In [33]:
type(df['Y'])

pandas.core.series.Series

In [34]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [36]:
# Create a new column

In [37]:
df['new']=df['W']+df['Y']

In [38]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [40]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [42]:
df.drop('new',axis=1,inplace=True) # inplace to change the original DataFrame

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df.drop('E') # Default is axis=0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [45]:
df.shape

(5, 4)

In [46]:
# Selecting rows

In [47]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [48]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [49]:
df.iloc[3] #Numerical based index

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [50]:
df.loc['B','Y'] # row,column

-0.8480769834036315

In [51]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [52]:
df<0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [53]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [54]:
booldf=df>0

In [55]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [56]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[df<0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [58]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [62]:
resultdf=df[df['W']>0]

In [60]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [65]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [67]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [69]:
df[(df['W']>0) and (df['Y']>1)] # and cannot compare series of operators (only
                                # scalar) we instead use &

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [70]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df[(df['W']>0) | (df['Y']>1)] # or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
# Reset the index, old index becomes a column

In [75]:
df.reset_index() # inplace=True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [76]:
newind='CA NY WY OR CO'.split()

In [77]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [78]:
df['States']=newind

In [79]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [80]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [3]:
# New lesson

In [4]:
# Index levels

In [5]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [6]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [7]:
inside

[1, 2, 3, 1, 2, 3]

In [8]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
zip(outside,inside)

In [10]:
list(zip(outside,inside)) # zip: create a list of tuples from two lists with
                          # the same length

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [11]:
from numpy.random import randn

In [12]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [13]:
df

             A         B
G1 1  0.498491 -0.255001
   2  0.609466  1.145436
   3 -0.059927 -0.732229
G2 1  0.835404 -0.249755
   2 -0.938884 -1.115109
   3  1.576536  1.469607

In [14]:
df.loc['G1']

          A         B
1  0.498491 -0.255001
2  0.609466  1.145436
3 -0.059927 -0.732229

In [15]:
df.loc['G1'].loc[2]

A    0.609466
B    1.145436
Name: 2, dtype: float64

In [16]:
df.index.names

FrozenList([None, None])

In [17]:
df.index.names=['Groups','Num']

In [18]:
df

                   A         B
Groups Num
G1     1    0.498491 -0.255001
       2    0.609466  1.145436
       3   -0.059927 -0.732229
G2     1    0.835404 -0.249755
       2   -0.938884 -1.115109
       3    1.576536  1.469607

In [20]:
df.loc['G2'].loc[2]['B']

-1.1151088651152048

In [21]:
# Cross section

In [22]:
df.xs('G1')

            A         B
Num
1    0.498491 -0.255001
2    0.609466  1.145436
3   -0.059927 -0.732229

In [23]:
df.xs(1,level='Num') # All values with 1 index (G1 and G2)

               A         B
Groups
G1      0.498491 -0.255001
G2      0.835404 -0.249755

In [28]:
np.random.seed(101)

In [ ]:
# Complete missing data

In [25]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [26]:
df=pd.DataFrame(d)

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
df.dropna() # Drop any row with missing value

     A    B  C
0  1.0  5.0  1

In [31]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [32]:
df.dropna(thresh=2) # Number of NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [33]:
df.fillna(value='Null value')

            A           B  C
0           1           5  1
1           2  Null value  2
2  Null value  Null value  3

In [34]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [3]:
# Groupby

In [4]:
data= {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],    
        'Sales':[200,120,340,124,243,350]}

In [5]:
df=pd.DataFrame(data)

In [6]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
df.groupby('Company')

In [8]:
byComp=df.groupby('Company')

In [9]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
byComp.sum().loc['FB'] # Sales sum of Facebook

Sales    593
Name: FB, dtype: int64

In [13]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [14]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [15]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [16]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [18]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [19]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [3]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','hgi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  hgi
3     4   444  xyz

In [4]:
# Finding unique values

In [6]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
df['col2'].nunique()

3

In [9]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [11]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [13]:
# Function
def times2(x):
    return 2*x

In [14]:
df['col1'].sum()

10

In [15]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col3'].apply(len) # Length of the strings

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [18]:
df['col2'].apply(lambda x:2*x)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [19]:
df.drop('col1',axis=1) # inplace=flase

   col2 col3
0   444  abc
1   555  def
2   666  hgi
3   444  xyz

In [20]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [21]:
df.columns[0]

'col1'

In [22]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [23]:
# Sorting

In [24]:
df.sort_values('col2') # by='col2'

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  hgi

In [25]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [26]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [27]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [28]:
# Pivot table

In [29]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [3]:
# Import CSV and Excel

In [4]:
pwd # directory

'd:\\Users\\MM15493\\Documents\\Python\\Python_for_Data_Science_and_Machine_Learning\\03-Python-for-Data-Analysis-Pandas'

In [7]:
df=pd.read_csv('example')

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
df.to_csv('My_output',index=False)

In [11]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
# Excel files (only data)

In [15]:
pd.read_excel('Excel_Sample.xlsx') # Sheetname=blahblah

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet') # Save to excel

In [18]:
# HTML pd.read_html

In [19]:
# List of tables data[0]=dataframe , .head()

In [20]:
# SQL

In [21]:
from sqlalchemy import create_engine

In [22]:
engine = create_engine('sqlite:///:memory:')

In [23]:
df.to_sql('my_table',engine)

In [24]:
sqldf=pd.read_sql('my_table',con=engine)

In [25]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [3]:
url='https://covid19.who.int/WHO-COVID-19-global-data.csv'
file_path=os.path.join('data','covid')
os.makedirs(file_path,exist_ok=True)

In [4]:
csv_path=os.path.join(file_path,'WHO-COVID-19-global-data.csv')
urllib.request.urlretrieve(url,csv_path)

('data\\covid\\WHO-COVID-19-global-data.csv',
 <http.client.HTTPMessage at 0x940ce08>)

In [5]:
df=pd.read_csv(csv_path)
df.head()

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,Cumulative_deaths
0,2020-01-03,AF,Afghanistan,EMRO,0,0,0,0
1,2020-01-04,AF,Afghanistan,EMRO,0,0,0,0
2,2020-01-05,AF,Afghanistan,EMRO,0,0,0,0
3,2020-01-06,AF,Afghanistan,EMRO,0,0,0,0
4,2020-01-07,AF,Afghanistan,EMRO,0,0,0,0

In [6]:
len(df)

66270

In [7]:
df.index

RangeIndex(start=0, stop=66270, step=1)

In [8]:
df.columns

Index(['Date_reported', ' Country_code', ' Country', ' WHO_region',
       ' New_cases', ' Cumulative_cases', ' New_deaths', ' Cumulative_deaths'],
      dtype='object')

In [9]:
df.index.values

array([    0,     1,     2, ..., 66267, 66268, 66269], dtype=int64)

In [10]:
df.values

array([['2020-01-03', 'AF', 'Afghanistan', ..., 0, 0, 0],
       ['2020-01-04', 'AF', 'Afghanistan', ..., 0, 0, 0],
       ['2020-01-05', 'AF', 'Afghanistan', ..., 0, 0, 0],
       ...,
       ['2020-10-08', 'ZW', 'Zimbabwe', ..., 7919, 0, 229],
       ['2020-10-09', 'ZW', 'Zimbabwe', ..., 7951, 0, 229],
       ['2020-10-10', 'ZW', 'Zimbabwe', ..., 7994, 0, 229]], dtype=object)

In [11]:
df.dtypes

Date_reported         object
 Country_code         object
 Country              object
 WHO_region           object
 New_cases             int64
 Cumulative_cases      int64
 New_deaths            int64
 Cumulative_deaths     int64
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66270 entries, 0 to 66269
Data columns (total 8 columns):
Date_reported         66270 non-null object
 Country_code         65988 non-null object
 Country              66270 non-null object
 WHO_region           66270 non-null object
 New_cases            66270 non-null int64
 Cumulative_cases     66270 non-null int64
 New_deaths           66270 non-null int64
 Cumulative_deaths    66270 non-null int64
dtypes: int64(4), object(4)
memory usage: 4.0+ MB

In [13]:
df.tail()

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,Cumulative_deaths
66265,2020-10-06,ZW,Zimbabwe,AFRO,10,7898,0,228
66266,2020-10-07,ZW,Zimbabwe,AFRO,17,7915,1,229
66267,2020-10-08,ZW,Zimbabwe,AFRO,4,7919,0,229
66268,2020-10-09,ZW,Zimbabwe,AFRO,32,7951,0,229
66269,2020-10-10,ZW,Zimbabwe,AFRO,43,7994,0,229

In [14]:
df.describe()

          New_cases   Cumulative_cases    New_deaths   Cumulative_deaths
count  66270.000000       6.627000e+04  66270.000000        66270.000000
mean     554.615890       4.165506e+04     16.068176         1608.504512
std     3940.668637       3.086796e+05    109.294868        10032.783810
min    -8261.000000       0.000000e+00   -514.000000            0.000000
25%        0.000000       0.000000e+00      0.000000            0.000000
50%        0.000000       1.870000e+02      0.000000            3.000000
75%       65.000000       4.805500e+03      1.000000           92.000000
max    97894.000000       7.525920e+06   6409.000000       211311.000000

In [15]:
df[' Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra',
       'Angola', 'Anguilla', 'Antigua and Barbuda', 'Argentina',
       'Armenia', 'Aruba', 'Australia', 'Austria', 'Azerbaijan',
       'Bahamas', 'Bahrain', 'Bangladesh', 'Barbados', 'Belarus',
       'Belgium', 'Belize', 'Benin', 'Bermuda', 'Bhutan',
       'Bolivia (Plurinational State of)',
       'Bonaire, Sint Eustatius and Saba', 'Bosnia and Herzegovina',
       'Botswana', 'Brazil', 'British Virgin Islands',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada', 'Cayman Islands',
       'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia',
       'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', 'Côte d’Ivoire',
       'Croatia', 'Cuba', 'Curaçao', 'Cyprus', 'Czechia',
       "Democratic People's Republic of Korea",
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Eswatini', 'Ethiopia', 'Falkland Islands (Malvinas)',
       'Faroe Islands', 'Fiji', 'Finland', 'France', 'French Guiana',
       'French Polynesia', 'Gabon', 'Gambia', 'Georgia', 'Germany',
       'Ghana', 'Gibraltar', 'Greece', 'Greenland', 'Grenada',
       'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey', 'Guinea',
       'Guinea-Bissau', 'Guyana', 'Haiti', 'Holy See', 'Honduras',
       'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran (Islamic Republic of)', 'Iraq', 'Ireland', 'Isle of Man',
       'Israel', 'Italy', 'Jamaica', 'Japan', 'Jersey', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'Kosovo[1]', 'Kuwait',
       'Kyrgyzstan', "Lao People's Democratic Republic", 'Latvia',
       'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Liechtenstein',
       'Lithuania', 'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia',
       'Maldives', 'Mali', 'Malta', 'Marshall Islands', 'Martinique',
       'Mauritania', 'Mauritius', 'Mayotte', 'Mexico',
       'Micronesia (Federated States of)', 'Monaco', 'Mongolia',
       'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Myanmar',
       'Namibia', 'Nauru', 'Nepal', 'Netherlands', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue',
       'North Macedonia',
       'Northern Mariana Islands (Commonwealth of the)', 'Norway',
       'occupied Palestinian territory, including east Jerusalem', 'Oman',
       'Other', 'Pakistan', 'Palau', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Peru', 'Philippines', 'Pitcairn Islands', 'Poland',
       'Portugal', 'Puerto Rico', 'Qatar', 'Republic of Korea',
       'Republic of Moldova', 'Réunion', 'Romania', 'Russian Federation',
       'Rwanda', 'Saint Barthélemy', 'Saint Helena',
       'Saint Kitts and Nevis', 'Saint Lucia', 'Saint Martin',
       'Saint Pierre and Miquelon', 'Saint Vincent and the Grenadines',
       'Samoa', 'San Marino', 'Sao Tome and Principe', 'Saudi Arabia',
       'Senegal', 'Serbia', 'Seychelles', 'Sierra Leone', 'Singapore',
       'Sint Maarten', 'Slovakia', 'Slovenia', 'Solomon Islands',
       'Somalia', 'South Africa', 'South Sudan', 'Spain', 'Sri Lanka',
       'Sudan', 'Suriname', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand',
       'The United Kingdom', 'Timor-Leste', 'Togo', 'Tokelau', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Turks and Caicos Islands', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates', 'United Republic of Tanzania',
       'United States of America', 'United States Virgin Islands',
       'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela (Bolivarian Republic of)', 'Viet Nam',
       'Wallis and Futuna', 'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [19]:
df.columns=[col.strip() for col in df.columns] # Remove space
df.columns

Index(['Date_reported', 'Country_code', 'Country', 'WHO_region', 'New_cases',
       'Cumulative_cases', 'New_deaths', 'Cumulative_deaths'],
      dtype='object')

In [20]:
df.Country

0        Afghanistan
1        Afghanistan
2        Afghanistan
3        Afghanistan
4        Afghanistan
            ...
66265       Zimbabwe
66266       Zimbabwe
66267       Zimbabwe
66268       Zimbabwe
66269       Zimbabwe
Name: Country, Length: 66270, dtype: object

In [21]:
df.loc[1:8,['Country','New_cases']]

       Country  New_cases
1  Afghanistan          0
2  Afghanistan          0
3  Afghanistan          0
4  Afghanistan          0
5  Afghanistan          0
6  Afghanistan          0
7  Afghanistan          0
8  Afghanistan          0

In [23]:
df[df.Country=='United States of America']

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,Cumulative_deaths
63168,2020-01-03,US,United States of America,AMRO,0,0,0,0
63169,2020-01-04,US,United States of America,AMRO,0,0,0,0
63170,2020-01-05,US,United States of America,AMRO,0,0,0,0
63171,2020-01-06,US,United States of America,AMRO,0,0,0,0
63172,2020-01-07,US,United States of America,AMRO,0,0,0,0
...,...,...,...,...,...,...,...,...
63445,2020-10-06,US,United States of America,AMRO,36136,7341406,369,208433
63446,2020-10-07,US,United States of America,AMRO,38920,7380326,354,208787
63447,2020-10-08,US,United States of America,AMRO,38904,7419230,663,209450
63448,2020-10-09,US,United States of America,AMRO,52458,7471688,888,210338
63449,2020-10-10,US,United States of America,AMRO,54232,7525920,973,211311

In [26]:
df.loc[df.New_deaths>1000,['New_deaths','Country']]

       New_deaths                           Country
2530         3351                         Argentina
7017         1610  Bolivia (Plurinational State of)
8035         1179                            Brazil
8037         1188                            Brazil
8038         1001                            Brazil
...           ...                               ...
63421        1078          United States of America
63422        1022          United States of America
63427        1204          United States of America
63434        1125          United States of America
63441        1024          United States of America

[219 rows x 2 columns]

In [27]:
df.loc[(df.New_deaths>1000) & (df.Country_code=='US'),['Date_reported','New_deaths']]

      Date_reported  New_deaths
63260    2020-04-04        1061
63261    2020-04-05        1166
63262    2020-04-06        1338
63263    2020-04-07        1201
63264    2020-04-08        1286
...             ...         ...
63421    2020-09-12        1078
63422    2020-09-13        1022
63427    2020-09-18        1204
63434    2020-09-25        1125
63441    2020-10-02        1024

[90 rows x 2 columns]